# WillRuleCheckElements Method (PerformanceAdviserRuleId) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PerformanceAdviser..::..WillRuleCheckElements Method (PerformanceAdviserRuleId)
PerformanceAdviser Class See Also
---
Reports if rule needs to be executed on individual elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool WillRuleCheckElements(
	PerformanceAdviserRuleId id
)
```

Visual Basic
---
```text
Public Function WillRuleCheckElements ( _
	id As PerformanceAdviserRuleId _
) As Boolean
```

Visual C++
---
```text
public:
bool WillRuleCheckElements(
	PerformanceAdviserRuleId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..PerformanceAdviserRuleId The rule id to get information for.
# ### Return Value
True if rule needs to be executed on individual elements.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PerformanceAdviser Class
WillRuleCheckElements Overload
Autodesk.Revit.DB Namespace